app/views/contacts/_form.html.erb

            <% attr[:selected] = session[:selected_group_id].to_i if session[:selected_group_id] %>
            <%= f.collection_select :group_id, Group.all, :id, :name, attr, class: "form-control" %>
---
SELECT "groups".* FROM "groups"