app/views/contacts/new.html.erb

                  <option value="">Select group</option>
                  <% Group.all.each do |group|%>
---
SELECT "groups".* FROM "groups"