app/controllers/contacts_controller.rb

SELECT COUNT(*) FROM "contacts" WHERE (LOWER(name) LIKE '%j%' or LOWER(company) LIKE '%j%' or LOWER(email) LIKE '%j%')
SELECT  "contacts".* FROM "contacts" WHERE (LOWER(name) LIKE '%car%' or LOWER(company) LIKE '%car%' or LOWER(email) LIKE '%car%') ORDER BY "contacts"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
---
  def index
    session[:selected_group_id] = params[:group_id]
    @contacts = Contact.by_group(params[:group_id]).search(params[:term]).order(created_at: :desc).page(params[:page])

INSERT INTO "contacts" ("name", "email", "company", "phone", "address", "group_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @contact = Contact.new(contact_params)
    if @contact.save

UPDATE "contacts" SET "group_id" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["group_id", 1], ["updated_at", "2020-05-05 13:41:07.197376"], ["id", 20]]
---
  def update
    if @contact.update(contact_params)

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
---
  def find_contact
    @contact = Contact.find(params[:id])