app/controllers/contacts_controller.rb

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
  def edit
    @contact = Contact.find(params[:id])

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
  def update
    @contact = Contact.find(params[:id])