app/controllers/contacts_controller.rb

  def autocomplete
    @contacts = current_user.contacts.search(params[:term]).order(created_at: :desc).page(params[:page])
---
SELECT  "contacts".* FROM "contacts" WHERE (LOWER(name) LIKE '%car%' or LOWER(company) LIKE '%car%' or LOWER(email) LIKE '%car%') ORDER BY "contacts"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]