app/controllers/groups_controller.rb

  def create
    @group = Group.new(group_params)
    if @group.save
---
INSERT INTO "groups" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "friend"], ["created_at", "2020-05-06 09:45:52.329725"], ["updated_at", "2020-05-06 09:45:52.329725"]]