app/views/layouts/_sidebar.html.erb

    <%= link_to contacts_path, class: "list-group-item #{active}" do %>
      All Contact <span class="badge"><%= Contact.count %></span>
---
SELECT COUNT(*) FROM "contacts"


    <% Group.all.each do |group|%>
---
SELECT "groups".* FROM "groups"

      <%= link_to contacts_path(group_id: group.id), class: "list-group-item #{active}" do %>
        <%= group.name %><span class="badge"><%= group.contacts.count %></span>
---
SELECT COUNT(*) FROM "contacts" WHERE "contacts"."group_id" = ?  [["group_id", 1]]